_posts/2020-03-19-whats-ap.html
---
layout: post
title: What's Ap?
date: '2020-03-19T00:00:00.000-08:00'
tags: [pure-functional-programming, cats, scala, applicative]
---
<div id="outline-container-org26ff951" class="outline-2">
<h2 id="org26ff951">Applicative Functors</h2>
<div class="outline-text-2" id="text-org26ff951">
<p>
This post is aimed at the Scala programmer who is familiar with the basics of
the language and ideally becoming interested, or already deeply entrenched, in
pure functional programming and curious about <code>Applicative Functors</code>. We&rsquo;ll
delve into the original paper in which they were introduced, converting the
Haskell code to modern Scala, and then look at an efficient implementation of
blending two images using Applicative progamming.
</p>
</div>
</div>
<div id="outline-container-org38ebe47" class="outline-2">
<h2 id="org38ebe47">Functor and Monad</h2>
<div class="outline-text-2" id="text-org38ebe47">
<p>
As a Scala programmer you will be no doubt be familar with the <code>map</code> and
<code>flatMap</code> functions, which you will find in some of the collections and other
data types in the standard Scala library. If you&rsquo;re interested in pure
functional programming, and have used the Cats or Scalaz libraries, you may know
that these two functions are part of the <code>Functor</code> and <code>Monad</code> type classes
respectively.
</p>

<p>
Before looking at <code>Apply</code> and <code>Applicative</code> let&rsquo;s review what you can do
Functors and Monads.
</p>

<p>
Remember, the goal of functional programming is to do most of our work using
pure functions. We use structures like Functors and Monads to manage effects
that are not pure; letting us use pure functions in an effectful world. The
Functor type class gives us the power to take a pure function like <code>a =&gt; a + 1</code>
and apply it to the value inside an effect. Here&rsquo;s an example using instances of
the Functor monad for List and Option&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a9a1e1;">List</span>(<span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>).map(a <span style="color: #51afef;">=&gt;</span> a + <span style="color: #da8548; font-weight: bold;">1</span>)
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">res: List[Int] = List(2, 3, 4)</span>

<span style="color: #a9a1e1;">Option</span>(<span style="color: #da8548; font-weight: bold;">1</span>).map(a <span style="color: #51afef;">=&gt;</span> a + <span style="color: #da8548; font-weight: bold;">1</span>)
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">res: Option[Int] = Some(2)</span>
</pre>
</div>

<p>
Whilst Functor gives you the ability to reach inside an effect, apply a pure
function to the value inside there, and wrap it up inside an effect of the same
type. The type signature of map is <code>map[A,B](fa: F[A], f: A =&gt; B): F[B]</code>.
</p>

<p>
Monad instances have two functions. The first, <code>pure</code> or <code>unit</code>, gives us a way
to lift pure values into an effectful context. <code>pure[A](a: A) F[A]</code> and you can
think of it as being a type constructor&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">import</span> cats.<span style="color: #51afef;">_</span>
<span style="color: #51afef;">import</span> cats.implicits.<span style="color: #51afef;">_</span>

<span style="color: #da8548; font-weight: bold;">1</span>.pure[<span style="color: #a9a1e1;">List</span>]
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">res: List[Int] = List(1)</span>

<span style="color: #da8548; font-weight: bold;">1</span>.pure[<span style="color: #a9a1e1;">Option</span>]
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">res: Option[Int] = Some(1)</span>
</pre>
</div>

<p>
Pure isn&rsquo;t really giving us something we didn&rsquo;t already have; we could make a
list and an option before. But the pure function is useful as a building block
when building code that uses Monad instances. We&rsquo;ll see it in use later.
</p>

<p>
Finally, Monad has the <code>flatMap</code> function. The signature is <code>flatMap[A,B](fa:
F[A], f: A =&gt; [B]): F[B]</code>. flatMap comes in handy when we compose two effects
together. It let&rsquo;s you get the result from the first and pass it as a (pure) parameter
to the next. For example, imagine we have two calls that go out over the network
to a database or external service and we use map to chain them together&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">def</span> <span style="color: #c678dd;">getUser</span>(email<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">String</span>)<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Future</span>[<span style="color: #a9a1e1;">User</span>] <span style="color: #51afef;">=</span> ???

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">getAccountStatus</span>(id<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">String</span>)<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Future</span>[<span style="color: #a9a1e1;">AccountStatus</span>] <span style="color: #51afef;">=</span> ???

<span style="color: #51afef;">val</span> <span style="color: #dcaeea;">accountStatus</span> <span style="color: #51afef;">=</span> getUser(<span style="color: #98be65;">"bob@google.com"</span>)
  .map(user <span style="color: #51afef;">=&gt;</span> getAccountStatus(user.accountId))
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">accountStatus has type Future[Future[AccountStatus]]</span>
</pre>
</div>

<p>
Dealing with nested effects like <code>Future[Future[_]]</code> creates a burden on us to
reach inside the layers one at a time. If we used flatMap instead it would take
care of flattening the result for us&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">val</span> <span style="color: #dcaeea;">accountStatus</span> <span style="color: #51afef;">=</span> getUser(<span style="color: #98be65;">"bob@google.com"</span>)
  .flatMap(user <span style="color: #51afef;">=&gt;</span> getAccountStatus(user.accountId))
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">accountStatus has type [Future[AccountStatus]</span>
</pre>
</div>

<p>
That is the essence of Monad&rsquo;s; being able to compose effects together. Note
that the second call is dependent on the first. It would make no sense to call
<code>getAccountStatus</code> before we called <code>getUser</code> because we need the user&rsquo;s account
ID. In fact, even if these two effects were completely independent, we would
still have to wait for the first one before calling the second. That&rsquo;s not an
ideal situation because these calls may take tens or even a few hundred
milliseconds. If we want the service to be low latency, we would like to run
these calls concurrently instead of in sequence.
</p>
</div>
</div>
<div id="outline-container-orgffa620d" class="outline-2">
<h2 id="orgffa620d">What&rsquo;s Ap?</h2>
<div class="outline-text-2" id="text-orgffa620d">
<p>
Now we&rsquo;re caught up Functors and Monads, let&rsquo;s look at the <code>Applicative</code>
typeclass. It is defined as follows in Cats, with some details removed&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">trait</span> <span style="color: #ECBE7B;">Applicative</span>[<span style="color: #a9a1e1;">F</span>[<span style="color: #51afef;">_</span>]] <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">Apply</span>[<span style="color: #a9a1e1;">F</span>] {
  <span style="color: #51afef;">def</span> <span style="color: #c678dd;">pure</span>[<span style="color: #a9a1e1;">A</span>](x<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">A</span>)<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">F</span>[<span style="color: #a9a1e1;">A</span>]
}
</pre>
</div>

<p>
If you make an instance of Applicative then you need to supply an implementation
of <code>pure</code> which is exactly the same as pure found in Monads. You also need to
implement <code>Apply</code> which looks like this&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">trait</span> <span style="color: #ECBE7B;">Apply</span>[<span style="color: #a9a1e1;">F</span>[<span style="color: #51afef;">_</span>]] <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">Functor</span>[<span style="color: #a9a1e1;">F</span>] {
  <span style="color: #51afef;">def</span> <span style="color: #c678dd;">ap</span>[<span style="color: #a9a1e1;">A</span>, <span style="color: #a9a1e1;">B</span>](ff<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">F</span>[<span style="color: #a9a1e1;">A</span> <span style="color: #51afef;">=&gt;</span> <span style="color: #a9a1e1;">B</span>])(fa<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">F</span>[<span style="color: #a9a1e1;">A</span>])<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">F</span>[<span style="color: #a9a1e1;">B</span>]
}
</pre>
</div>

<p>
You can see that <code>Apply</code> extends Functor which means it has map. Also it has the
function <code>ap</code> which is, of course, the main subject of this post. What a curious
type signature! Just like with <code>map</code> we are dealing with an effect type <code>F</code>, and
a parameter <code>F[A]</code>. The difference is the function we want to <i>apply</i> (<code>ff: F[A
=&gt; B]=</code>) is also <i>inside the effect</i>.
</p>

<p>
Before talking about what this is useful for, let&rsquo;s look at what it actually
does for various implementations.
</p>
</div>
