org/posts/2020-03-19-whats-ap.org
*** Applicative instance for Option

#+BEGIN_SRC scala
Option((a:Int) => a + 10).ap(Option(20))
// res: Option[Int] = Some(30)

Option((a:Int) => a + 10).ap(None)
// res: Option[Int] = None

Option.empty[Int => Int].ap(Option(20))
// res: Option[Int] = None

Option.empty[Int => Int].ap(Option.empty[Int])
// res: Option[Int] = None
#+END_SRC

The ap function for Option, then, behaves probably as you'd expect. When you
/apply/ the function, if the ~ff~ argument is ~None~ then there's nothing to
apply and we get the result ~None~. If there is a function in there, we extract
it so that we have a /pure function/ that we can /apply/ to the effectful
argument ~F[A]~. Again, if that is empty we get ~None~, otherwise we get the
value ~f(a)~ which will be wrapped back up in the effect giving ~Some(30)~.

*** Applicative instance for List

#+BEGIN_SRC scala
List((a:Int) => a + 1,
     (a:Int) => a - 10,
     (a:Int) => a + 22).ap(List(1,2,3))
// res: List[Int] = List(2, 3, 4, -9, -8, -7, 23, 24, 25)
#+END_SRC

For ~List~ the input value for ~ff~ has the signature ~List[A => B]~, and each
function in the list is applied to each argument in the input list.

*** Idomaticly apply all the things
All data types that have instances of Applicative have a way to apply a
function wrapped in an effect of that type, and the way that it is applied is
/idomatic/ to that effect. In fact, before the name ~Applicative Functor~ stuck,
they were called ~Idioms~.

You may be scratching your head at this point, for it's not often in programming
that you want to apply a list of functions to a list (although I'm sure you can
probably come up with some ways to use it), and how often do you have functions
in Options? It gets weirder in the case of other data types. With ~Future~, or
~IO~, for example, do you ever remember writing a function that returns a
function from a Future? It's certainly rare. Still more strange would be a
function inside a ~State~ monad, but that is perfectly valid too...

#+BEGIN_SRC scala
import cats.data.State

// Create a function in a State
val fs = State[Int, (Int => Int)]
  (s => (s, (a: Int) => a + s))

// Now to apply it to an appropriate State
val applied = fs.ap(State[Int, Int](s => (s,10)))

// Finally run the Applicative State and grab the value
applied.run(10).value
//res: (Int, Int) = (10, 20)
#+END_SRC

So, everything that has an Applicative can handle pure functions that have been
lifted into effects. In some cases that seems marginally useful and in other
cases seems rather weird. Why is that? I'm going to bury the lede and in the
next section we'll look back to 2008 when Applicative Functors first show up in
academic literature...

** Applicative Programming with Effects

*** Let's Apply ourselves
Applicative Functors first saw light of day in the 2008 paper by McBride and
Patterson, "Applicative Programming with Effects" which you can find here...

[[https://www.staff.city.ac.uk/~ross/papers/Applicative.pdf]]

The paper begins with three motivating examples for the use of Applicative style...

#+BEGIN_QUOTE
This is the story of a pattern that popped up time and again in our daily work,
programming in Haskell (Peyton Jones, 2003), until the temptation to abstract it
became irresistable. Let us illustrate with some examples.
#+END_QUOTE

We'll walk through each of these examples and convert them to use Scala...

