_posts/2020-03-19-whats-ap.html

<div id="outline-container-orgc54ea37" class="outline-3">
<h3 id="orgc54ea37">Applicative instance for Option</h3>
<div class="outline-text-3" id="text-orgc54ea37">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a9a1e1;">Option</span>((a<span style="color: #51afef;">:</span><span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> a + <span style="color: #da8548; font-weight: bold;">10</span>).ap(<span style="color: #a9a1e1;">Option</span>(<span style="color: #da8548; font-weight: bold;">20</span>))
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">res: Option[Int] = Some(30)</span>

<span style="color: #a9a1e1;">Option</span>((a<span style="color: #51afef;">:</span><span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> a + <span style="color: #da8548; font-weight: bold;">10</span>).ap(<span style="color: #a9a1e1;">None</span>)
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">res: Option[Int] = None</span>

<span style="color: #a9a1e1;">Option</span>.empty[<span style="color: #a9a1e1;">Int</span> <span style="color: #51afef;">=&gt;</span> <span style="color: #a9a1e1;">Int</span>].ap(<span style="color: #a9a1e1;">Option</span>(<span style="color: #da8548; font-weight: bold;">20</span>))
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">res: Option[Int] = None</span>

<span style="color: #a9a1e1;">Option</span>.empty[<span style="color: #a9a1e1;">Int</span> <span style="color: #51afef;">=&gt;</span> <span style="color: #a9a1e1;">Int</span>].ap(<span style="color: #a9a1e1;">Option</span>.empty[<span style="color: #a9a1e1;">Int</span>])
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">res: Option[Int] = None</span>
</pre>
</div>

<p>
The ap function for Option, then, behaves probably as you&rsquo;d expect. When you
<i>apply</i> the function, if the <code>ff</code> argument is <code>None</code> then there&rsquo;s nothing to
apply and we get the result <code>None</code>. If there is a function in there, we extract
it so that we have a <i>pure function</i> that we can <i>apply</i> to the effectful
argument <code>F[A]</code>. Again, if that is empty we get <code>None</code>, otherwise we get the
value <code>f(a)</code> which will be wrapped back up in the effect giving <code>Some(30)</code>.
</p>
</div>
</div>

<div id="outline-container-org78882d1" class="outline-3">
<h3 id="org78882d1">Applicative instance for List</h3>
<div class="outline-text-3" id="text-org78882d1">
<div class="org-src-container">
<pre class="src src-scala"><span style="color: #a9a1e1;">List</span>((a<span style="color: #51afef;">:</span><span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> a + <span style="color: #da8548; font-weight: bold;">1</span>,
     (a<span style="color: #51afef;">:</span><span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> a - <span style="color: #da8548; font-weight: bold;">10</span>,
     (a<span style="color: #51afef;">:</span><span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> a + <span style="color: #da8548; font-weight: bold;">22</span>).ap(<span style="color: #a9a1e1;">List</span>(<span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>))
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">res: List[Int] = List(2, 3, 4, -9, -8, -7, 23, 24, 25)</span>
</pre>
</div>

<p>
For <code>List</code> the input value for <code>ff</code> has the signature <code>List[A =&gt; B]</code>, and each
function in the list is applied to each argument in the input list.
</p>
</div>
</div>

<div id="outline-container-org422c4d1" class="outline-3">
<h3 id="org422c4d1">Idomaticly apply all the things</h3>
<div class="outline-text-3" id="text-org422c4d1">
<p>
All data types that have instances of Applicative have a way to apply a
function wrapped in an effect of that type, and the way that it is applied is
<i>idomatic</i> to that effect. In fact, before the name <code>Applicative Functor</code> stuck,
they were called <code>Idioms</code>.
</p>

<p>
You may be scratching your head at this point, for it&rsquo;s not often in programming
that you want to apply a list of functions to a list (although I&rsquo;m sure you can
probably come up with some ways to use it), and how often do you have functions
in Options? It gets weirder in the case of other data types. With <code>Future</code>, or
<code>IO</code>, for example, do you ever remember writing a function that returns a
function from a Future? It&rsquo;s certainly rare. Still more strange would be a
function inside a <code>State</code> monad, but that is perfectly valid too&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">import</span> cats.data.<span style="color: #a9a1e1;">State</span>

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Create a function in a State</span>
<span style="color: #51afef;">val</span> <span style="color: #dcaeea;">fs</span> <span style="color: #51afef;">=</span> <span style="color: #a9a1e1;">State</span>[<span style="color: #a9a1e1;">Int</span>, (<span style="color: #a9a1e1;">Int</span> <span style="color: #51afef;">=&gt;</span> <span style="color: #a9a1e1;">Int</span>)]
  (s <span style="color: #51afef;">=&gt;</span> (s, (a<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> a + s))

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Now to apply it to an appropriate State</span>
<span style="color: #51afef;">val</span> <span style="color: #dcaeea;">applied</span> <span style="color: #51afef;">=</span> fs.ap(<span style="color: #a9a1e1;">State</span>[<span style="color: #a9a1e1;">Int</span>, <span style="color: #a9a1e1;">Int</span>](s <span style="color: #51afef;">=&gt;</span> (s,<span style="color: #da8548; font-weight: bold;">10</span>)))

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Finally run the Applicative State and grab the value</span>
applied.run(<span style="color: #da8548; font-weight: bold;">10</span>).value
<span style="color: #5B6268;">//</span><span style="color: #5B6268;">res: (Int, Int) = (10, 20)</span>
</pre>
</div>

<p>
So, everything that has an Applicative can handle pure functions that have been
lifted into effects. In some cases that seems marginally useful and in other
cases seems rather weird. Why is that? I&rsquo;m going to bury the lede and in the
next section we&rsquo;ll look back to 2008 when Applicative Functors first show up in
academic literature&#x2026;
</p>
</div>
</div>
</div>

<div id="outline-container-orga1a6532" class="outline-2">
<h2 id="orga1a6532">Applicative Programming with Effects</h2>
<div class="outline-text-2" id="text-orga1a6532">
</div>
<div id="outline-container-org4887ecc" class="outline-3">
<h3 id="org4887ecc">Let&rsquo;s Apply ourselves</h3>
<div class="outline-text-3" id="text-org4887ecc">
<p>
Applicative Functors first saw light of day in the 2008 paper by McBride and
Patterson, &ldquo;Applicative Programming with Effects&rdquo; which you can find here&#x2026;
</p>

<p>
<a href="https://www.staff.city.ac.uk/~ross/papers/Applicative.pdf">https://www.staff.city.ac.uk/~ross/papers/Applicative.pdf</a>
</p>

<p>
The paper begins with three motivating examples for the use of Applicative style&#x2026;
</p>

<blockquote>
<p>
This is the story of a pattern that popped up time and again in our daily work,
programming in Haskell (Peyton Jones, 2003), until the temptation to abstract it
became irresistable. Let us illustrate with some examples.
</p>
</blockquote>

<p>
We&rsquo;ll walk through each of these examples and convert them to use Scala&#x2026;
</p>
</div>
