_posts/2020-03-19-whats-ap.html

<div id="outline-container-org9719544" class="outline-4">
<h4 id="org9719544">Sequencing Commands</h4>
<div class="outline-text-4" id="text-org9719544">
<blockquote>
<p>
One often wants to execute a sequence of commands and
collect the sequence of their responses, and indeed there is such a function in the
Haskell Prelude (here specialised to IO)
</p>
</blockquote>
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #c678dd;">sequence</span> <span style="color: #dcaeea;">::</span> [<span style="color: #ECBE7B;">IO</span> a ] <span style="color: #dcaeea;">&#8594;</span> <span style="color: #ECBE7B;">IO</span> [a ]
<span style="color: #c678dd;">sequence</span> [ ] <span style="color: #dcaeea;">=</span> return [ ]
<span style="color: #c678dd;">sequence</span> (c <span style="color: #ECBE7B;">:</span> cs) <span style="color: #dcaeea;">=</span> <span style="color: #51afef;">do</span>
  x <span style="color: #dcaeea;">&#8592;</span> c
  xs <span style="color: #dcaeea;">&#8592;</span> sequence cs
</pre>
</div>

<p>
Before we get started, if you&rsquo;re following along in your Scala IDE or REPL you
will need some imports listed below. You can also clone the Github repository.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">import</span> zio.<span style="color: #51afef;">_</span>
<span style="color: #51afef;">import</span> zio.console.<span style="color: #51afef;">_</span>
<span style="color: #51afef;">import</span> zio.clock.<span style="color: #51afef;">_</span>
<span style="color: #51afef;">import</span> zio.duration.<span style="color: #51afef;">_</span>
<span style="color: #51afef;">import</span> cats.<span style="color: #a9a1e1;">Applicative</span>
<span style="color: #51afef;">import</span> cats.implicits.<span style="color: #51afef;">_</span>
</pre>
</div>

<p>
&#x2026; and the following libraries &#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala">libraryDependencies ++= <span style="color: #a9a1e1;">Seq</span>(
 <span style="color: #98be65;">"org.typelevel"</span> %% <span style="color: #98be65;">"cats-core"</span> % <span style="color: #98be65;">"2.1.1"</span>,
 <span style="color: #98be65;">"dev.zio"</span> %% <span style="color: #98be65;">"zio"</span> % <span style="color: #98be65;">"1.0.0-RC18"</span>)
</pre>
</div>

<p>
I am using ZIO in place of Haskell&rsquo;s IO Monad, and bringing in Cats to use its
Applicative.
</p>

<p>
Converting the sequence function from Haskell to Scala&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala">  <span style="color: #51afef;">def</span> <span style="color: #c678dd;">monadicSequence</span>[<span style="color: #a9a1e1;">Z</span>,<span style="color: #a9a1e1;">E</span>,<span style="color: #a9a1e1;">A</span>](ios<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">List</span>[<span style="color: #a9a1e1;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>, <span style="color: #a9a1e1;">E</span>, <span style="color: #a9a1e1;">A</span>]])<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>, <span style="color: #a9a1e1;">E</span>, <span style="color: #a9a1e1;">List</span>[<span style="color: #a9a1e1;">A</span>]] <span style="color: #51afef;">=</span> {
    ios <span style="color: #51afef;">match</span> {
      <span style="color: #51afef;">case</span> <span style="color: #a9a1e1;">Nil</span> <span style="color: #51afef;">=&gt;</span>
        zioApplicative.pure(<span style="color: #a9a1e1;">List</span>.empty[<span style="color: #a9a1e1;">A</span>])
      <span style="color: #51afef;">case</span> <span style="color: #dcaeea;">c</span> <span style="color: #ECBE7B;">::</span> <span style="color: #dcaeea;">cs</span> <span style="color: #51afef;">=&gt;</span>
        <span style="color: #51afef;">for</span> (
          x <span style="color: #51afef;">&lt;-</span> c;
          xs <span style="color: #51afef;">&lt;-</span> monadicSequence(cs)
        ) <span style="color: #51afef;">yield</span> (x +: xs)
    }
  }
</pre>
</div>

<p>
If you&rsquo;re not familiar with <code>ZIO</code> you can think of it as a replacement for the standard library
Scala <code>Future</code>, but it has better performance and a lot more features. It is
also not eagerly evaluated like Future. To explain, when you create a future it runs
immediately and you cannot run it again. You can create a ZIO and run it when
you decide to and as many times as you want.
</p>

<p>
To demonstrate this sequence running let&rsquo;s write an implementation of a silly
algorithm called Sleep Sort. Sleep Sort works by waiting an amount of time based
on the value of the number. Emitting the numbers in this way sorts them
(assuming your scheduler is accurate enough). Let&rsquo;s be clear, this is a stupid
way to sort numbers, but it&rsquo;s handy as a way to illustrate our <code>monadicSequence</code>
function.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">def</span> <span style="color: #c678dd;">delayedPrintNumber</span>(s<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Int</span>)<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">ZIO</span>[<span style="color: #a9a1e1;">Console</span> <span style="color: #51afef;">with</span> <span style="color: #ECBE7B;">Clock</span>,<span style="color: #a9a1e1;">String</span>,<span style="color: #a9a1e1;">Int</span>] <span style="color: #51afef;">=</span> {
    putStrLn(s<span style="color: #98be65;">"Preparing to say number in </span><span style="color: #dcaeea;">$s</span><span style="color: #98be65;"> seconds"</span>) *&gt;
    putStrLn(s<span style="color: #98be65;">"</span><span style="color: #dcaeea;">$s</span><span style="color: #98be65;">"</span>).delay(s.seconds) *&gt;
    <span style="color: #a9a1e1;">ZIO</span>.succeed(s)
}
<span style="color: #51afef;">val</span> <span style="color: #dcaeea;">ios1</span> <span style="color: #51afef;">=</span> <span style="color: #a9a1e1;">List</span>(<span style="color: #da8548; font-weight: bold;">6</span>,<span style="color: #da8548; font-weight: bold;">5</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">8</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">7</span>).map(delayedPrintNumber)
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">ios1: List[ZIO[Console with Clock,String,Int]]</span>
</pre>
</div>

<p>
The function creates an IO effect, which when run will immediately print a
message and then wait <code>s</code> seconds before printing the number. We map the
function across a list of numbers to generate a list of IO effects, which we can
then run.
</p>

<p>
You may be surprised that this does not work. Instead of running all the effects
at once and printing them out in order it just executes the first IO (wait 6
seconds), then the second (wait 5 seconds).
</p>

<pre class="example">
Monadic version

Preparing to say number in 6 seconds
6
Preparing to say number in 5 seconds
5
// ... and so on for a while
</pre>

<p>
If you were not surprised maybe you&rsquo;re ahead of me, and know that our
<code>monadicSequence</code> function cannot possibly run all the effects at once by virtue
of it being monadic in the first place.
</p>

<p>
That <code>for</code> comprehension is really hiding that we are calling flatMap on each
successive IO, and flatMap sequences things together. You must wait for the
result of the first effect before you can evaluate the second. So whilst the
first implementation of <code>sequence</code> in the paper will absolutely work, it will
not let us implement our sleep sort, nor let us parallelize the IO&rsquo;s in general.
</p>

<p>
Anyway let&rsquo;s get back to the paper, at this point the authors observe&#x2026;
</p>

<blockquote>
<p>
In the (c : cs) case, we collect the values of some effectful computations, which we
then use as the arguments to a pure function (:). We could avoid the need for names
to wire these values through to their point of usage if we had a kind of ‘effectful
application’.
</p>
</blockquote>

<p>
By effectful application they are talking about the <code>ap</code> function, and they go
on to say that it lives in the Haskell Monad library. Given that function they
rewrite the <code>sequence</code> function as follows&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #c678dd;">sequence</span> <span style="color: #dcaeea;">::</span> [<span style="color: #ECBE7B;">IO</span> a ] <span style="color: #dcaeea;">&#8594;</span> <span style="color: #ECBE7B;">IO</span> [a ]
<span style="color: #c678dd;">sequence</span> [ ] <span style="color: #dcaeea;">=</span> return [ ]
<span style="color: #c678dd;">sequence</span> (c <span style="color: #ECBE7B;">:</span> cs) <span style="color: #dcaeea;">=</span> return (<span style="color: #ECBE7B;">:</span>) &#8216;ap&#8216; c &#8216;ap&#8216; sequence cs
</pre>
</div>

<blockquote>
<p>
Except for the noise of the returns and aps, this definition is in a fairly standard
applicative style, even though effects are present.
</p>
</blockquote>

<p>
Note that the <code>ap</code> they are using here is in the Monad library, and implemented
using flatMap, so it will not yet allow our sleep sort to work. However, I&rsquo;ve
implemented an Applicative instance for ZIO which does not have that
limitation&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #c678dd;">implicit</span> <span style="color: #51afef;">def</span> <span style="color: #c678dd;">zioApplicative</span>[<span style="color: #a9a1e1;">Z</span>,<span style="color: #a9a1e1;">E</span>] <span style="color: #51afef;">=</span> <span style="color: #51afef;">new</span> <span style="color: #ECBE7B;">Applicative</span>[<span style="color: #a9a1e1;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>,<span style="color: #a9a1e1;">E</span>,?]] {
    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">pure</span>[<span style="color: #a9a1e1;">A</span>](x<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">A</span>) <span style="color: #51afef;">=</span> <span style="color: #a9a1e1;">ZIO</span>.succeed(x)
    <span style="color: #51afef;">def</span> <span style="color: #c678dd;">ap</span>[<span style="color: #a9a1e1;">A</span>, <span style="color: #a9a1e1;">B</span>](ff<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>,<span style="color: #a9a1e1;">E</span>,<span style="color: #a9a1e1;">A</span> <span style="color: #51afef;">=&gt;</span> <span style="color: #a9a1e1;">B</span>])(fa<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>,<span style="color: #a9a1e1;">E</span>,<span style="color: #a9a1e1;">A</span>]) <span style="color: #51afef;">=</span> {
      map2(ff, fa){
        (f,a) <span style="color: #51afef;">=&gt;</span>
          f(a)
      }
    }
    <span style="color: #c678dd;">override</span> <span style="color: #51afef;">def</span> <span style="color: #c678dd;">map2</span>[<span style="color: #a9a1e1;">A</span>, <span style="color: #a9a1e1;">B</span>, <span style="color: #a9a1e1;">C</span>](fa<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>,<span style="color: #a9a1e1;">E</span>,<span style="color: #a9a1e1;">A</span>], fb<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>,<span style="color: #a9a1e1;">E</span>,<span style="color: #a9a1e1;">B</span>])(f<span style="color: #51afef;">:</span> (<span style="color: #a9a1e1;">A</span>, <span style="color: #a9a1e1;">B</span>) <span style="color: #51afef;">=&gt;</span> <span style="color: #a9a1e1;">C</span>) <span style="color: #51afef;">:</span>
      <span style="color: #a9a1e1;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>,<span style="color: #a9a1e1;">E</span>,<span style="color: #a9a1e1;">C</span>] <span style="color: #51afef;">=</span> {
        fa.zipPar(fb).map{<span style="color: #51afef;">case</span> (<span style="color: #dcaeea;">a</span>,<span style="color: #dcaeea;">b</span>) <span style="color: #51afef;">=&gt;</span> f(a,b)}
    }
  }
</pre>
</div>

<p>
It&rsquo;s not important to understand all the details here, all you need understand
is we now have an <code>ap</code> that we can apply to ZIO effects that is truly parallel,
so if you&rsquo;re not interested then skip to the next paragraph.
</p>

<div class="aside">
<p>
The <code>pure</code> function is straightforward, it just wraps a pure value in a
succeeded ZIO. The <code>ap</code> function is more interesting. Whilst it&rsquo;s not obvious
how you would implemented ap in for ZIO, it is really easy to implement <code>map2</code>.
<code>map2</code> comes in handy because it lets you take the results of two effects and
pass them to a pure function. The function has the signature <code>f: (A, B) =&gt; C</code>.
We use the ZIO function <code>zipPar</code> to execute the two effects <span class="underline">in parallel</span>, and
if both <code>fa</code> and <code>fb</code> yield values then they are mapped with the pure function
giving us a ZIO with the final result inside. Happily, you can implement ap in
terms of map2, so that solves our problem.
</p>

</div>

<p>
Here&rsquo;s the conversion of the applicative version of <code>sequence</code> to Scala&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">def</span> <span style="color: #c678dd;">applicativeSequence</span>[<span style="color: #a9a1e1;">Z</span>,<span style="color: #a9a1e1;">E</span>,<span style="color: #a9a1e1;">A</span>](ios<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">List</span>[<span style="color: #a9a1e1;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>, <span style="color: #a9a1e1;">E</span>, <span style="color: #a9a1e1;">A</span>]])<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>, <span style="color: #a9a1e1;">E</span>, <span style="color: #a9a1e1;">List</span>[<span style="color: #a9a1e1;">A</span>]] <span style="color: #51afef;">=</span> {
    ios <span style="color: #51afef;">match</span> {
      <span style="color: #51afef;">case</span> <span style="color: #a9a1e1;">Nil</span> <span style="color: #51afef;">=&gt;</span>
        <span style="color: #a9a1e1;">ZIO</span>.succeed(<span style="color: #a9a1e1;">List</span>.empty[<span style="color: #a9a1e1;">A</span>])
      <span style="color: #51afef;">case</span> <span style="color: #dcaeea;">c</span> <span style="color: #ECBE7B;">::</span> <span style="color: #dcaeea;">cs</span> <span style="color: #51afef;">=&gt;</span>
        <span style="color: #51afef;">val</span> <span style="color: #dcaeea;">ff</span><span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">ZIO</span>[<span style="color: #a9a1e1;">Z</span>,<span style="color: #a9a1e1;">E</span>, <span style="color: #a9a1e1;">A</span> <span style="color: #51afef;">=&gt;</span> (<span style="color: #a9a1e1;">List</span>[<span style="color: #a9a1e1;">A</span>] <span style="color: #51afef;">=&gt;</span> <span style="color: #a9a1e1;">List</span>[<span style="color: #a9a1e1;">A</span>])] <span style="color: #51afef;">=</span>
          zioApplicative.pure(((a<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">A</span>) <span style="color: #51afef;">=&gt;</span> (listA<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">List</span>[<span style="color: #a9a1e1;">A</span>]) <span style="color: #51afef;">=&gt;</span> a +: listA))
        <span style="color: #51afef;">val</span> <span style="color: #dcaeea;">p1</span> <span style="color: #51afef;">=</span> ff.ap(c)
        p1.ap(applicativeSequence(cs))
    }
  }
</pre>
</div>

<p>
It&rsquo;s a little bit noisier than the Haskell code, but most of that is having to
be more verbose about the types to keep the type checker happy. In fact the
parts of each implementation match up together.
</p>

<p>
Now we can run that and you will see that the effects are now parellelised and
our sleep sort works!
</p>

<pre class="example">
Applicative version

Preparing to say number in 6 seconds
Preparing to say number in 2 seconds
Preparing to say number in 1 seconds
Preparing to say number in 3 seconds
Preparing to say number in 8 seconds
Preparing to say number in 4 seconds
Preparing to say number in 7 seconds
Preparing to say number in 5 seconds
1
2
3
4
5
6
7
8
</pre>

<p>
Note that the point the authors were making here was just to show that the
<code>sequence</code> function is a pattern that came up often, that could be more
succinctly expressed with <code>ap</code>. Showing that it also enables our effects to run
in parallel, given the correct implementation, was just to show one of the
benefits of avoiding Monad when effects are not dependent on each other.
</p>
</div>
</div>
