org/posts/2020-03-19-whats-ap.org
**** Matrix Transposition
The second example in the paper is that of Matrix transposition, which takes a
matrix and flips it along a diagonal. For example...

#+BEGIN_SRC
Original matrix
 1  2  3  4  5
 6  7  8  9 10
11 12 13 14 15

Transposed matrix
 1  6 11
 2  7 12
 3  8 13
 4  9 14
 5 10 15
#+END_SRC

In Haskell, we first see this implememtation of transpose...

#+BEGIN_SRC haskell
transpose :: [[a ]] → [[a ]]
transpose [ ] = repeat [ ]
transpose (xs : xss) = zipWith (:) xs (transpose xss)

repeat :: a → [a ]
repeat x = x : repeat x
#+END_SRC

Let's translate this to Scala. The algorithm works by taking each row in turn
and /zipping/ it with each subsequent row.

First we need to be careful about the function ~repeat~ which returns an
infinite number of whatever x is. This is used in the transpose for the last row
of the matrix where we want a number of empty lists to finish our recursion but
we don't know how many, so we want to just keep taking them. Since Haskell is by
default lazily evaluated this will work fine. In Scala as soon as we evaluate
repeat we will run into an infinite loop. That's easily fixed by switching to
~LazyList~ which is part of the standard library. (Before Scala 2.13 it was
called Stream).

#+BEGIN_SRC scala
def repeat[A](a: A): LazyList[A] = a #:: repeat(a)
#+END_SRC

The function ~zipWith~ has the following type signature...

#+BEGIN_SRC haskell
zipWith :: (a -> b -> c) -> [a] -> [b] -> [c]
#+END_SRC

In other words it takes two lists and a pure function of two arguments, and
creates a new list by applying the function to each element. It will stop once
it runs out of elements in one of the lists. Here's the Scala version.

#+BEGIN_SRC scala
def zipWith[A, B, C](as: LazyList[A], bs: LazyList[B])(
      f: (A, B) => C): LazyList[C] = {
    as.zip(bs).map { case (a, b) => f(a, b) }
  }
#+END_SRC

With the pieces in place I can now implement the transpose as follows...

#+BEGIN_SRC scala
def transpose[A](matrix: LazyList[LazyList[A]]): LazyList[LazyList[A]] = {
  matrix match {
    case LazyList() => repeat(LazyList.empty)
    case xs #:: xss =>
      zipWith(xs, transpose(xss)) {
        case (a, as) =>
          a +: as
      }
  }
}
#+END_SRC

The next step in the paper is to make this look a bit more /applicative/ by
using a combination of ~repeat~ and ~zapp~...

#+BEGIN_SRC haskell
zapp :: [a → b ] → [a ] → [b ]
zapp (f : fs) (x : xs) = f x : zapp fs xs
zapp = [ ]

transpose :: [[a ]] → [[a ]]
transpose [ ] = repeat [ ]
transpose (xs : xss) = repeat (:) ‘zapp‘ xs ‘zapp‘ transpose xss
#+END_SRC

#+BEGIN_QUOTE
Except for the noise of the repeats and zapps, this definition is in a fairly standard
applicative style, even though we are working with vectors.
#+END_QUOTE

