org/posts/2020-03-19-whats-ap.org
**** Evaluating Expressions
The third example of applicative style is an expression evaluator that can add
numbers, both literals and numbers bound to strings and stored in an environment.

#+BEGIN_QUOTE
When implementing an evaluator for a language of expressions, it is customary to
pass around an environment, giving values to the free variables.
#+END_QUOTE

The Haskell code looks like this...

#+BEGIN_SRC haskell
data Exp v = Var v
  | Val Int
  | Add (Exp v) (Exp v)

eval :: Exp v → Env v → Int
eval (Var x ) γ = fetch x γ
eval (Val i) γ = i
eval (Add p q) γ = eval p γ + eval q γ
#+END_SRC

Converting to Scala is straightforward...

#+BEGIN_SRC scala
sealed trait Exp
case class Val(value: Int) extends Exp
case class Add(left: Exp, right: Exp) extends Exp
case class Var(key: String) extends Exp

case class Env[K](kv: Map[K,Int])

def fetch(key: String)(env: Env[String]) : Int =
  env.kv.getOrElse(key, 0)

def eval(exp: Exp, env: Env[String]) : Int = {
  exp match {
    case Val(value) => value
    case Var(key) => fetch(key)(env)
    case Add(left, right) =>
      eval(left, env) + eval(right, env)
  }
}
#+END_SRC

Here I've made the environment a simple key value store, and, to avoid
complicating the example with error handling, if a variable is not present in
the environment I just default to returning zero.

Following the pattern of the previous two examples, the authors then pull some
magic to make the applicative pattern more noticable...

#+BEGIN_QUOTE
We can eliminate the clutter of the explicitly threaded environment with a little
help from some very old friends, designed for this purpose
#+END_QUOTE

#+BEGIN_SRC haskell
eval :: Exp v → Env v → Int
eval (Var x ) = fetch x
eval (Val i) = K i
eval (Add p q) = K (+) ‘S‘ eval p ‘S‘ eval q

where
K :: a → env → a
K x γ = x

S :: (env → a → b) → (env → a) → (env → b)
S ef es γ = (ef γ) (es γ)
#+END_SRC

So this all looks a bit cryptic. Who are the old friends? Well, if you look at
the type signature of ~K~ it is actually the ~pure~ function, and ~S~
is the ~ap~ function. This is in fact what we'd call the ~Reader~ Monad in
Scala.

By old friends, the authors are referring to the [[https://en.wikipedia.org/wiki/SKI_combinator_calculus][SKI Combinator Calculus]].

Let's reimplement in Scala using the ~Reader~.

#+BEGIN_SRC scala
def fetchR(key: String) = Reader[Map[String,Int], Int](env => env.getOrElse(key, 0))
def pureR(value: Int) = Reader[Map[String,Int], Int](env => value)

def evalR(exp: Exp): Reader[Map[String,Int], Int] = {
  exp match {
    case Val(value) => pureR(value)
    case Var(key) => fetchR(key)
    case Add(left, right) =>
      val f = Reader((env:Map[String,Int]) =>
        (a:Int) => (b:Int) => a + b)
      val leftEval = evalR(left).ap(f)
      evalR(right).ap(leftEval)
  }
}
#+END_SRC

And take it for a test drive...

#+BEGIN_SRC scala
val env1 = Env(Map("x" -> 3, "y" -> 10))
val exp1 = Add(Val(10), Add(Var("x"), Var("y")))

println(s"Eval : ${eval(exp1, env1)}")
// Eval : 23
#+END_SRC

