_posts/2020-03-19-whats-ap.html

<div id="outline-container-org15f9128" class="outline-4">
<h4 id="org15f9128">Evaluating Expressions</h4>
<div class="outline-text-4" id="text-org15f9128">
<p>
The third example of applicative style is an expression evaluator that can add
numbers, both literals and numbers bound to strings and stored in an environment.
</p>

<blockquote>
<p>
When implementing an evaluator for a language of expressions, it is customary to
pass around an environment, giving values to the free variables.
</p>
</blockquote>

<p>
The Haskell code looks like this&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #51afef;">data</span> <span style="color: #ECBE7B;">Exp</span> v <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">Var</span> v
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">Val</span> <span style="color: #ECBE7B;">Int</span>
  <span style="color: #dcaeea;">|</span> <span style="color: #ECBE7B;">Add</span> (<span style="color: #ECBE7B;">Exp</span> v) (<span style="color: #ECBE7B;">Exp</span> v)

<span style="color: #c678dd;">eval</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Exp</span> v <span style="color: #dcaeea;">&#8594;</span> <span style="color: #ECBE7B;">Env</span> v <span style="color: #dcaeea;">&#8594;</span> <span style="color: #ECBE7B;">Int</span>
<span style="color: #c678dd;">eval</span> (<span style="color: #ECBE7B;">Var</span> x ) &#947; <span style="color: #dcaeea;">=</span> fetch x &#947;
<span style="color: #c678dd;">eval</span> (<span style="color: #ECBE7B;">Val</span> i) &#947; <span style="color: #dcaeea;">=</span> i
<span style="color: #c678dd;">eval</span> (<span style="color: #ECBE7B;">Add</span> p q) &#947; <span style="color: #dcaeea;">=</span> eval p &#947; <span style="color: #dcaeea;">+</span> eval q &#947;
</pre>
</div>

<p>
Converting to Scala is straightforward&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #c678dd;">sealed</span> <span style="color: #51afef;">trait</span> <span style="color: #ECBE7B;">Exp</span>
<span style="color: #51afef;">case</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Val</span>(value<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">Exp</span>
<span style="color: #51afef;">case</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Add</span>(left<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Exp</span>, right<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Exp</span>) <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">Exp</span>
<span style="color: #51afef;">case</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Var</span>(key<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">String</span>) <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">Exp</span>

<span style="color: #51afef;">case</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">Env</span>[<span style="color: #a9a1e1;">K</span>](kv<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Map</span>[<span style="color: #a9a1e1;">K</span>,<span style="color: #a9a1e1;">Int</span>])

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">fetch</span>(key<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">String</span>)(env<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Env</span>[<span style="color: #a9a1e1;">String</span>]) <span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Int</span> <span style="color: #51afef;">=</span>
  env.kv.getOrElse(key, <span style="color: #da8548; font-weight: bold;">0</span>)

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">eval</span>(exp<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Exp</span>, env<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Env</span>[<span style="color: #a9a1e1;">String</span>]) <span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Int</span> <span style="color: #51afef;">=</span> {
  exp <span style="color: #51afef;">match</span> {
    <span style="color: #51afef;">case</span> <span style="color: #ECBE7B;">Val</span>(<span style="color: #dcaeea;">value</span>) <span style="color: #51afef;">=&gt;</span> value
    <span style="color: #51afef;">case</span> <span style="color: #ECBE7B;">Var</span>(<span style="color: #dcaeea;">key</span>) <span style="color: #51afef;">=&gt;</span> fetch(key)(env)
    <span style="color: #51afef;">case</span> <span style="color: #ECBE7B;">Add</span>(<span style="color: #dcaeea;">left</span>, <span style="color: #dcaeea;">right</span>) <span style="color: #51afef;">=&gt;</span>
      eval(left, env) + eval(right, env)
  }
}
</pre>
</div>

<p>
Here I&rsquo;ve made the environment a simple key value store, and, to avoid
complicating the example with error handling, if a variable is not present in
the environment I just default to returning zero.
</p>

<p>
Following the pattern of the previous two examples, the authors then pull some
magic to make the applicative pattern more noticable&#x2026;
</p>

<blockquote>
<p>
We can eliminate the clutter of the explicitly threaded environment with a little
help from some very old friends, designed for this purpose
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #c678dd;">eval</span> <span style="color: #dcaeea;">::</span> <span style="color: #ECBE7B;">Exp</span> v <span style="color: #dcaeea;">&#8594;</span> <span style="color: #ECBE7B;">Env</span> v <span style="color: #dcaeea;">&#8594;</span> <span style="color: #ECBE7B;">Int</span>
<span style="color: #c678dd;">eval</span> (<span style="color: #ECBE7B;">Var</span> x ) <span style="color: #dcaeea;">=</span> fetch x
<span style="color: #c678dd;">eval</span> (<span style="color: #ECBE7B;">Val</span> i) <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">K</span> i
<span style="color: #c678dd;">eval</span> (<span style="color: #ECBE7B;">Add</span> p q) <span style="color: #dcaeea;">=</span> <span style="color: #ECBE7B;">K</span> (<span style="color: #dcaeea;">+</span>) &#8216;<span style="color: #ECBE7B;">S</span>&#8216; eval p &#8216;<span style="color: #ECBE7B;">S</span>&#8216; eval q

<span style="color: #51afef;">where</span>
<span style="color: #ECBE7B;">K</span> <span style="color: #dcaeea;">::</span> a <span style="color: #dcaeea;">&#8594;</span> env <span style="color: #dcaeea;">&#8594;</span> a
<span style="color: #ECBE7B;">K</span> x &#947; <span style="color: #dcaeea;">=</span> x

<span style="color: #ECBE7B;">S</span> <span style="color: #dcaeea;">::</span> (env <span style="color: #dcaeea;">&#8594;</span> a <span style="color: #dcaeea;">&#8594;</span> b) <span style="color: #dcaeea;">&#8594;</span> (env <span style="color: #dcaeea;">&#8594;</span> a) <span style="color: #dcaeea;">&#8594;</span> (env <span style="color: #dcaeea;">&#8594;</span> b)
<span style="color: #ECBE7B;">S</span> ef es &#947; <span style="color: #dcaeea;">=</span> (ef &#947;) (es &#947;)
</pre>
</div>

<p>
So this all looks a bit cryptic. Who are the old friends? Well, if you look at
the type signature of <code>K</code> it is actually the <code>pure</code> function, and <code>S</code>
is the <code>ap</code> function. This is in fact what we&rsquo;d call the <code>Reader</code> Monad in
Scala.
</p>

<p>
By old friends, the authors are referring to the <a href="https://en.wikipedia.org/wiki/SKI_combinator_calculus">SKI Combinator Calculus</a>.
</p>

<p>
Let&rsquo;s reimplement in Scala using the <code>Reader</code>.
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">def</span> <span style="color: #c678dd;">fetchR</span>(key<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">String</span>) <span style="color: #51afef;">=</span> <span style="color: #a9a1e1;">Reader</span>[<span style="color: #a9a1e1;">Map</span>[<span style="color: #a9a1e1;">String</span>,<span style="color: #a9a1e1;">Int</span>], <span style="color: #a9a1e1;">Int</span>](env <span style="color: #51afef;">=&gt;</span> env.getOrElse(key, <span style="color: #da8548; font-weight: bold;">0</span>))
<span style="color: #51afef;">def</span> <span style="color: #c678dd;">pureR</span>(value<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=</span> <span style="color: #a9a1e1;">Reader</span>[<span style="color: #a9a1e1;">Map</span>[<span style="color: #a9a1e1;">String</span>,<span style="color: #a9a1e1;">Int</span>], <span style="color: #a9a1e1;">Int</span>](env <span style="color: #51afef;">=&gt;</span> value)

<span style="color: #51afef;">def</span> <span style="color: #c678dd;">evalR</span>(exp<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Exp</span>)<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Reader</span>[<span style="color: #a9a1e1;">Map</span>[<span style="color: #a9a1e1;">String</span>,<span style="color: #a9a1e1;">Int</span>], <span style="color: #a9a1e1;">Int</span>] <span style="color: #51afef;">=</span> {
  exp <span style="color: #51afef;">match</span> {
    <span style="color: #51afef;">case</span> <span style="color: #ECBE7B;">Val</span>(<span style="color: #dcaeea;">value</span>) <span style="color: #51afef;">=&gt;</span> pureR(value)
    <span style="color: #51afef;">case</span> <span style="color: #ECBE7B;">Var</span>(<span style="color: #dcaeea;">key</span>) <span style="color: #51afef;">=&gt;</span> fetchR(key)
    <span style="color: #51afef;">case</span> <span style="color: #ECBE7B;">Add</span>(<span style="color: #dcaeea;">left</span>, <span style="color: #dcaeea;">right</span>) <span style="color: #51afef;">=&gt;</span>
      <span style="color: #51afef;">val</span> <span style="color: #dcaeea;">f</span> <span style="color: #51afef;">=</span> <span style="color: #a9a1e1;">Reader</span>((env<span style="color: #51afef;">:</span><span style="color: #ECBE7B;">Map</span>[<span style="color: #a9a1e1;">String</span>,<span style="color: #a9a1e1;">Int</span>]) <span style="color: #51afef;">=&gt;</span>
        (a<span style="color: #51afef;">:</span><span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> (b<span style="color: #51afef;">:</span><span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> a + b)
      <span style="color: #51afef;">val</span> <span style="color: #dcaeea;">leftEval</span> <span style="color: #51afef;">=</span> evalR(left).ap(f)
      evalR(right).ap(leftEval)
  }
}
</pre>
</div>

<p>
And take it for a test drive&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">val</span> <span style="color: #dcaeea;">env1</span> <span style="color: #51afef;">=</span> <span style="color: #a9a1e1;">Env</span>(<span style="color: #a9a1e1;">Map</span>(<span style="color: #98be65;">"x"</span> -&gt; <span style="color: #da8548; font-weight: bold;">3</span>, <span style="color: #98be65;">"y"</span> -&gt; <span style="color: #da8548; font-weight: bold;">10</span>))
<span style="color: #51afef;">val</span> <span style="color: #dcaeea;">exp1</span> <span style="color: #51afef;">=</span> <span style="color: #a9a1e1;">Add</span>(<span style="color: #a9a1e1;">Val</span>(<span style="color: #da8548; font-weight: bold;">10</span>), <span style="color: #a9a1e1;">Add</span>(<span style="color: #a9a1e1;">Var</span>(<span style="color: #98be65;">"x"</span>), <span style="color: #a9a1e1;">Var</span>(<span style="color: #98be65;">"y"</span>)))

println(s<span style="color: #98be65;">"Eval : </span><span style="color: #dcaeea;">${eval(exp1, env1)}</span><span style="color: #98be65;">"</span>)
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Eval : 23</span>
</pre>
</div>
</div>
</div>
</div>
