_posts/2020-03-19-whats-ap.html

<div id="outline-container-org01f79f5" class="outline-3">
<h3 id="org01f79f5">The Applicative Type class</h3>
<div class="outline-text-3" id="text-org01f79f5">
<p>
To summarize, we&rsquo;ve seen three different effects used in applicative style; IO
(or ZIO), List and Reader. Now you can see why it makes sense to be able to
apply a function that is wrapped in these effects. What we needed, and got with
<code>ap</code>, is a way to lift a pure function so we can apply it to a chain of effects
of the same effect type.
</p>

<p>
Next in the paper the authors describe the laws which an instance of the
Applicative type class must adhere to, which is out of scope for this post but
is put succinctly in English as follows&#x2026;
</p>

<blockquote>
<p>
The idea is that pure embeds pure computations into the pure fragment of an
effectful world—the resulting computations may thus be shunted around freely, as
long as the order of the genuinely effectful computations is preserved.
</p>
</blockquote>

<p>
Next we are show that <i>Applicatives are all Functors</i> (hence the name
Applicative Functors), because you can implement the map operation as follows&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #5B6268;">// </span><span style="color: #5B6268;">Declare map in terms of pure and ap</span>
<span style="color: #51afef;">def</span> <span style="color: #c678dd;">map</span>[<span style="color: #a9a1e1;">A</span>,<span style="color: #a9a1e1;">B</span>,<span style="color: #a9a1e1;">F</span>[<span style="color: #51afef;">_</span>]<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Applicative</span>](fa<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">F</span>[<span style="color: #a9a1e1;">A</span>], f<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">A</span> <span style="color: #51afef;">=&gt;</span> <span style="color: #a9a1e1;">B</span>)<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">F</span>[<span style="color: #a9a1e1;">B</span>] <span style="color: #51afef;">=</span> {
  <span style="color: #a9a1e1;">Applicative</span>[<span style="color: #a9a1e1;">F</span>].pure(f).ap(fa)
}

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Map a function over a list</span>
map(<span style="color: #a9a1e1;">List</span>(<span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>,<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>,<span style="color: #da8548; font-weight: bold;">5</span>), (a<span style="color: #51afef;">:</span><span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> a + <span style="color: #da8548; font-weight: bold;">1</span>)
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">res: List[Int] = List(2, 3, 4, 5, 6)</span>
</pre>
</div>

<p>
Note that you don&rsquo;t have to do this with Cats instances because all
Applicatives have their Functor instance taken care of too.
</p>

<p>
The paper then notes that all uses of Applicatives follow this pattern of
lifting a pure function and applying it to a chain of effects, and suggests a
new syntax for shifting into the <i>Idiom</i> of the applicative functor. The syntax
is a special pair of brackets&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-haskell">[[ ff f1 f2 f3 <span style="color: #dcaeea;">...</span> fn ]]
</pre>
</div>

<p>
Although this has not been widely adopted in either Haskell or Scala as far as I
can tell, you can try it yourself using this delightfully named (and
implemented) Scala library: <a href="https://github.com/sammthomson/IdiomEars">Idiom Ears</a>. This will let you closely match the
syntax from the paper; for example&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-scala"><span style="color: #51afef;">val</span> <span style="color: #dcaeea;">f</span> <span style="color: #51afef;">=</span> (a<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> (b<span style="color: #51afef;">:</span> <span style="color: #ECBE7B;">Int</span>) <span style="color: #51afef;">=&gt;</span> a * b
&#8847;| (f) (<span style="color: #a9a1e1;">List</span>(<span style="color: #da8548; font-weight: bold;">1</span>, <span style="color: #da8548; font-weight: bold;">2</span>)) (<span style="color: #a9a1e1;">List</span>(<span style="color: #da8548; font-weight: bold;">3</span>, <span style="color: #da8548; font-weight: bold;">4</span>)) |&#8848;
<span style="color: #5B6268;">// </span><span style="color: #5B6268;">List(3, 4, 6, 8)</span>

<span style="color: #5B6268;">// </span><span style="color: #5B6268;">Which is equivalent to</span>
<span style="color: #a9a1e1;">Applicative</span>[<span style="color: #a9a1e1;">List</span>].pure(f).ap(<span style="color: #a9a1e1;">List</span>(<span style="color: #da8548; font-weight: bold;">1</span>,<span style="color: #da8548; font-weight: bold;">2</span>)).ap(<span style="color: #a9a1e1;">List</span>(<span style="color: #da8548; font-weight: bold;">3</span>,<span style="color: #da8548; font-weight: bold;">4</span>))
</pre>
</div>

<p>
If you do fall in love with the idiom brackets of McBride and Patterson then
knock yourself out, but you may have to invest some time bringing the project
back to life as it has suffered some bitrot since 2016. There is a demo of
IdiomEars in the Github repository accompanying this post, but I simply copied
the code into my project rather than spend time updating it.
</p>
</div>
</div>
